[
    {
        "quote": "“The truth.\" Dumbledore sighed. \"It is a beautiful and terrible thing, and should therefore be treated with great caution.”",
        "author": "J.K. Rowling",
        "authorUrl": "https://quotes.toscrape.com/author/J-K-Rowling",
        "tags": ["truth"],
        "authorDetail": {
            "bornDate": "July 31, 1965",
            "bornLocation": "in Yate, South Gloucestershire, England, The United Kingdom",
            "description": "See also: Robert GalbraithAlthough she writes under the pen name J.K. Rowling, pronounced like rolling, her name when her first Harry Potter book was published was simply Joanne Rowling. Anticipating that the target audience of young boys might not want to read a book written by a woman, her publishers demanded that she use two initials, rather than her full name. As she had no middle name, she chose K as the second initial of her pen name, from her paternal grandmother Kathleen Ada Bulgen Rowling. She calls herself Jo and has said, \"No one ever called me 'Joanne' when I was young, unless they were angry.\" Following her marriage, she has sometimes used the name Joanne Murray when conducting personal business. During the Leveson Inquiry she gave evidence under the name of Joanne Kathleen Rowling. In a 2012 interview, Rowling noted that she no longer cared that people pronounced her name incorrectly.Rowling was born to Peter James Rowling, a Rolls-Royce aircraft engineer, and Anne Rowling (née Volant), on 31 July 1965 in Yate, Gloucestershire, England, 10 miles (16 km) northeast of Bristol. Her mother Anne was half-French and half-Scottish. Her parents first met on a train departing from King's Cross Station bound for Arbroath in 1964. They married on 14 March 1965. Her mother's maternal grandfather, Dugald Campbell, was born in Lamlash on the Isle of Arran. Her mother's paternal grandfather, Louis Volant, was awarded the Croix de Guerre for exceptional bravery in defending the village of Courcelles-le-Comte during the First World War.Rowling's sister Dianne was born at their home when Rowling was 23 months old. The family moved to the nearby village Winterbourne when Rowling was four. She attended St Michael's Primary School, a school founded by abolitionist William Wilberforce and education reformer Hannah More. Her headmaster at St Michael's, Alfred Dunn, has been suggested as the inspiration for the Harry Potter headmaster Albus Dumbledore.As a child, Rowling often wrote fantasy stories, which she would usually then read to her sister. She recalls that: \"I can still remember me telling her a story in which she fell down a rabbit hole and was fed strawberries by the rabbit family inside it. Certainly the first story I ever wrote down (when I was five or six) was about a rabbit called Rabbit. He got the measles and was visited by his friends, including a giant bee called Miss Bee.\" At the age of nine, Rowling moved to Church Cottage in the Gloucestershire village of Tutshill, close to Chepstow, Wales. When she was a young teenager, her great aunt, who Rowling said \"taught classics and approved of a thirst for knowledge, even of a questionable kind,\" gave her a very old copy of Jessica Mitford's autobiography, Hons and Rebels. Mitford became Rowling's heroine, and Rowling subsequently read all of her books.Rowling has said of her teenage years, in an interview with The New Yorker, \"I wasn’t particularly happy. I think it’s a dreadful time of life.\" She had a difficult homelife; her mother was ill and she had a difficult relationship with her father (she is no longer on speaking terms with him). She attended secondary school at Wyedean School and College, where her mother had worked as a technician in the science department. Rowling said of her adolescence, \"Hermione [a bookish, know-it-all Harry Potter character] is loosely based on me. She's a caricature of me when I was eleven, which I'm not particularly proud of.\" Steve Eddy, who taught Rowling English when she first arrived, remembers her as \"not exceptional\" but \"one of a group of girls who were bright, and quite good at English.\" Sean Harris, her best friend in the Upper Sixth owned a turquoise Ford Anglia, which she says inspired the one in her books."
        }
    },
    {
        "quote": "“I'm the one that's got to die when it's time for me to die, so let me live my life the way I want to.”",
        "author": "Jimi Hendrix",
        "authorUrl": "https://quotes.toscrape.com/author/Jimi-Hendrix",
        "tags": ["death", "life"],
        "authorDetail": {
            "bornDate": "November 27, 1942",
            "bornLocation": "in Seattle, Washington, The United States",
            "description": "Jimi Hendrix was an American guitarist, singer and songwriter. Hendrix is considered one of the greatest and most influential guitarists in rock music history. After initial success in Europe, he achieved fame in the USA following his 1967 performance at the Monterey Pop Festival. Later, Hendrix headlined the iconic 1969 Woodstock Festival.Hendrix helped develop the technique of guitar feedback with overdriven amplifiers. He was influenced by blues artists such as B.B. King, Muddy Waters, Albert King, and Elmore James, rhythm and blues and soul guitarists Curtis Mayfield, Steve Cropper, as well as by some modern jazz.Carlos Santana has suggested that Hendrix's music may have been influenced by his Native American heritage. As a record producer, Hendrix also broke new ground in using the recording studio as an extension of his musical ideas; he was one of the first to experiment with stereophonic and phasing effects during recording.Hendrix won many of the most prestigious rock music awards in his lifetime and has been posthumously awarded many more, including being inducted into the USA's Rock and Roll Hall of Fame in 1992 and the UK Music Hall of Fame in 2005. An English Heritage \"Blue plaque\" was erected in his name on his former residence at Brook Street, London in September 1997 and his star on the Hollywood Walk of Fame (at 6627 Hollywood Blvd.) was dedicated in 1994. In 2006, his debut USA album, Are You Experienced, was inducted into the United States National Recording Registry and Rolling Stone named Hendrix number 1 on their list of the 100 Greatest Guitarists of All Time in 2003."
        }
    },
    {
        "quote": "“To die will be an awfully big adventure.”",
        "author": "J.M. Barrie",
        "authorUrl": "https://quotes.toscrape.com/author/J-M-Barrie",
        "tags": ["adventure", "love"],
        "authorDetail": {
            "bornDate": "May 09, 1860",
            "bornLocation": "in Kirriemuir, Angus, Scotland, The United Kingdom",
            "description": "Sir James Matthew Barrie, 1st Baronet, OM (9 May 1860 – 19 June 1937) was a Scottish author and dramatist, best remembered today as the creator of Peter Pan.The child of a family of small-town weavers, he was educated in Scotland. He moved to London, where he developed a career as a novelist and playwright. There he met the Llewelyn Davies boys who inspired him in writing about a baby boy who has magical adventures in Kensington Gardens (included in The Little White Bird), then to write Peter Pan, or The Boy Who Wouldn't Grow Up, a \"fairy play\" about this ageless boy and an ordinary girl named Wendy who have adventures in the fantasy setting of Neverland. This play quickly overshadowed his previous work and although he continued to write successfully, it became his best-known work, credited with popularising the name Wendy, which was very uncommon previously.Barrie unofficially adopted the Davies boys following the deaths of their parents. Before his death, he gave the rights to the Peter Pan works to Great Ormond Street Hospital, which continues to benefit from them."
        }
    },
    {
        "quote": "“It takes courage to grow up and become who you really are.”",
        "author": "E.E. Cummings",
        "authorUrl": "https://quotes.toscrape.com/author/E-E-Cummings",
        "tags": ["courage"],
        "authorDetail": {
            "bornDate": "October 14, 1894",
            "bornLocation": "in Cambridge, Massachusetts, The United States",
            "description": "Edward Estlin Cummings was born in Cambridge, Massachusetts, on October 14, 1894. He began writing poems as early as 1904 and studied Latin and Greek at the Cambridge Latin High School.He received his BA in 1915 and his MA in 1916, both from Harvard University. His studies there introduced him to the poetry of avant-garde writers, such as Gertrude Stein and Ezra Pound.In 1917, Cummings published an early selection of poems in the anthology Eight Harvard Poets. The same year, Cummings left the United States for France as a volunteer ambulance driver in World War I. Five months after his assignment, however, he and a friend were interned in a prison camp by the French authorities on suspicion of espionage (an experience recounted in his novel, The Enormous Room) for his outspoken anti-war convictions.After the war, he settled into a life divided between houses in rural Connecticut and Greenwich Village, with frequent visits to Paris. He also traveled throughout Europe, meeting poets and artists, including Pablo Picasso, whose work he particularly admired.In 1920, The Dial published seven poems by Cummings, including \"Buffalo Bill ’s.” Serving as Cummings’ debut to a wider American audience, these “experiments” foreshadowed the synthetic cubist strategy Cummings would explore in the next few years.In his work, Cummings experimented radically with form, punctuation, spelling, and syntax, abandoning traditional techniques and structures to create a new, highly idiosyncratic means of poetic expression. Later in his career, he was often criticized for settling into his signature style and not pressing his work toward further evolution. Nevertheless, he attained great popularity, especially among young readers, for the simplicity of his language, his playful mode and his attention to subjects such as war and sex.The poet and critic Randall Jarrell once noted that Cummings is “one of the most individual poets who ever lived—and, though it sometimes seems so, it is not just his vices and exaggerations, the defects of his qualities, that make a writer popular. But, primarily, Mr. Cummings’s poems are loved because they are full of sentimentally, of sex, of more or less improper jokes, of elementary lyric insistence.”During his lifetime, Cummings received a number of honors, including an Academy of American Poets Fellowship, two Guggenheim Fellowships, the Charles Eliot Norton Professorship at Harvard, the Bollingen Prize in Poetry in 1958, and a Ford Foundation grant.At the time of his death, September 3, 1962, he was the second most widely read poet in the United States, after Robert Frost. He is buried in Forest Hills Cemetery in Boston, Massachusetts.source: http://www.poets.org/poetsorg/poet/e-..."
        }
    },
    {
        "quote": "“But better to get hurt by the truth than comforted with a lie.”",
        "author": "Khaled Hosseini",
        "authorUrl": "https://quotes.toscrape.com/author/Khaled-Hosseini",
        "tags": ["life"],
        "authorDetail": {
            "bornDate": "March 04, 1965",
            "bornLocation": "in Kabul, Afghanistan",
            "description": "Hosseini was born in Kabul, Afghanistan, in 1965. In 1970 Hosseini and his family moved to Iran where his father worked for the Embassy of Afghanistan in Tehran. In 1973 Hosseini's family returned to Kabul, and Hosseini's youngest brother was born in July of that year.In 1976, when Hosseini was 11 years old, Hosseini's father obtained a job in Paris, France, and moved the family there. They were unable to return to Afghanistan because of the Saur Revolution in which the PDPA communist party seized power through a bloody coup in April 1978. Instead, a year after the Soviet invasion of Afghanistan, in 1980 they sought political asylum in the United States and made their residence in San Jose, California.Hosseini graduated from Independence High School in San Jose in 1984 and enrolled at Santa Clara University, where he earned a bachelor's degree in biology in 1988. The following year, he entered the University of California, San Diego, School of Medicine, where he earned his M.D. in 1993. He completed his residency in internal medicine at Cedars-Sinai Medical Center in Los Angeles in 1996. He practiced medicine for over ten years, until a year and a half after the release of The Kite Runner.Hosseini is currently a Goodwill Envoy for the United Nations High Commissioner for Refugees (UNHCR). He has been working to provide humanitarian assistance in Afghanistan through the Khaled Hosseini Foundation. The concept for the foundation was inspired by the trip to Afghanistan that Hosseini made in 2007 with UNHCR.He lives in Northern California with his wife, Roya, and their two children (Harris and Farah)."
        }
    },
    {
        "quote": "“You never really understand a person until you consider things from his point of view... Until you climb inside of his skin and walk around in it.”",
        "author": "Harper Lee",
        "authorUrl": "https://quotes.toscrape.com/author/Harper-Lee",
        "tags": ["better-life-empathy"],
        "authorDetail": {
            "bornDate": "April 28, 1926",
            "bornLocation": "in Monroeville, Alabama, The United States",
            "description": "Harper Lee, known as Nelle, was born in the Alabama town of Monroeville, the youngest of four children of Amasa Coleman Lee and Frances Cunningham Finch Lee. Her father, a former newspaper editor and proprietor, was a lawyer who served on the state legislature from 1926 to 1938. As a child, Lee was a tomboy and a precocious reader, and enjoyed the friendship of her schoolmate and neighbor, the young Truman Capote.After graduating from high school in Monroeville, Lee enrolled at the all-female Huntingdon College in Montgomery (1944-45), and then pursued a law degree at the University of Alabama (1945-50), pledging the Chi Omega sorority. While there, she wrote for several student publications and spent a year as editor of the campus humor magazine, \"Ramma-Jamma\". Though she did not complete the law degree, she studied for a summer in Oxford, England, before moving to New York in 1950, where she worked as a reservation clerk with Eastern Air Lines and BOAC.Lee continued as a reservation clerk until the late 50s, when she devoted herself to writing. She lived a frugal life, traveling between her cold-water-only apartment in New York to her family home in Alabama to care for her father.Having written several long stories, Harper Lee located an agent in November 1956. The following month at the East 50th townhouse of her friends Michael Brown and Joy Williams Brown, she received a gift of a year's wages with a note: \"You have one year off from your job to write whatever you please. Merry Christmas.\" Within a year, she had a first draft. Working with J. B. Lippincott & Co. editor Tay Hohoff, she completed To Kill a Mockingbird in the summer of 1959. Published July 11, 1960, the novel was an immediate bestseller and won great critical acclaim, including the Pulitzer Prize for Fiction in 1961. It remains a bestseller with more than 30 million copies in print. In 1999, it was voted \"Best Novel of the Century\" in a poll by the Library Journal."
        }
    },
    {
        "quote": "“You have to write the book that wants to be written. And if the book will be too difficult for grown-ups, then you write it for children.”",
        "author": "Madeleine L'Engle",
        "authorUrl": "https://quotes.toscrape.com/author/Madeleine-LEngle",
        "tags": [
            "books",
            "children",
            "difficult",
            "grown-ups",
            "write",
            "writers",
            "writing"
        ],
        "authorDetail": {
            "bornDate": "November 29, 1918",
            "bornLocation": "in New York City, New York, The United States",
            "description": "Madeleine L'Engle was an American writer best known for her Young Adult fiction, particularly the Newbery Medal-winning A Wrinkle in Time and its sequels A Wind in the Door, A Swiftly Tilting Planet, and Many Waters. Her works reflect her strong interest in modern science: tesseracts, for example, are featured prominently in A Wrinkle in Time, mitochondrial DNA in A Wind in the Door, organ regeneration in The Arm of the Starfish, and so forth.\"Madeleine was born on November 29th, 1918, and spent her formative years in New York City. Instead of her school work, she found that she would much rather be writing stories, poems and journals for herself, which was reflected in her grades (not the best). However, she was not discouraged.At age 12, she moved to the French Alps with her parents and went to an English boarding school where, thankfully, her passion for writing continued to grow. She flourished during her high school years back in the United States at Ashley Hall in Charleston, South Carolina, vacationing with her mother in a rambling old beach cottage on a beautiful stretch of Florida Beach.She went to Smith College and studied English with some wonderful teachers as she read the classics and continued her own creative writing. She graduated with honors and moved into a Greenwich Village apartment in New York. She worked in the theater, where Equity union pay and a flexible schedule afforded her the time to write! She published her first two novels during these years--A Small Rain and Ilsa--before meeting Hugh Franklin, her future husband, when she was an understudy in Anton Chekov's The Cherry Orchard. They married during The Joyous Season.She had a baby girl and kept on writing, eventually moving to Connecticut to raise the family away from the city in a small dairy farm village with more cows than people. They bought a dead general store, and brought it to life for 9 years. They moved back to the city with three children, and Hugh revitalized his professional acting career. The family has kept the country house, Crosswicks, and continues to spend summers there.As the years passed and the children grew, Madeleine continued to write and Hugh to act, and they to enjoy each other and life. Madeleine began her association with the Cathedral Church of St. John the Divine, where she has been the librarian and maintained an office for more than thirty years. After Hugh's death in 1986, it was her writing and lecturing that kept her going. She has now lived through the 20th century and into the 21st and has written over 60 books and keeps writing. She enjoys being with her friends, her children, her grandchildren, and her great grandchildren.\"http://us.macmillan.com/author/madele...Copyright © 2007 Crosswicks, Ltd. (Madeleine L'Engle, President)"
        }
    },
    {
        "quote": "“Never tell the truth to people who are not worthy of it.”",
        "author": "Mark Twain",
        "authorUrl": "https://quotes.toscrape.com/author/Mark-Twain",
        "tags": ["truth"],
        "authorDetail": {
            "bornDate": "November 30, 1835",
            "bornLocation": "in Florida, Missouri, The United States",
            "description": "Samuel Langhorne Clemens, better known by his pen name Mark Twain, was an American author and humorist. He is noted for his novels Adventures of Huckleberry Finn (1885), called \"the Great American Novel\", and The Adventures of Tom Sawyer (1876).Twain grew up in Hannibal, Missouri, which would later provide the setting for Huckleberry Finn and Tom Sawyer. He apprenticed with a printer. He also worked as a typesetter and contributed articles to his older brother Orion's newspaper. After toiling as a printer in various cities, he became a master riverboat pilot on the Mississippi River, before heading west to join Orion. He was a failure at gold mining, so he next turned to journalism. While a reporter, he wrote a humorous story, \"The Celebrated Jumping Frog of Calaveras County,\" which proved to be very popular and brought him nationwide attention. His travelogues were also well-received. Twain had found his calling.He achieved great success as a writer and public speaker. His wit and satire earned praise from critics and peers, and he was a friend to presidents, artists, industrialists, and European royalty.However, he lacked financial acumen. Though he made a great deal of money from his writings and lectures, he squandered it on various ventures, in particular the Paige Compositor, and was forced to declare bankruptcy. With the help of Henry Huttleston Rogers, however, he eventually overcame his financial troubles. Twain worked hard to ensure that all of his creditors were paid in full, even though his bankruptcy had relieved him of the legal responsibility.Born during a visit by Halley's Comet, he died on its return. He was lauded as the \"greatest American humorist of his age\", and William Faulkner called Twain \"the father of American literature\".Excerpted from Wikipedia."
        }
    },
    {
        "quote": "“A person's a person, no matter how small.”",
        "author": "Dr. Seuss",
        "authorUrl": "https://quotes.toscrape.com/author/Dr-Seuss",
        "tags": ["inspirational"],
        "authorDetail": {
            "bornDate": "March 02, 1904",
            "bornLocation": "in Springfield, MA, The United States",
            "description": "Theodor Seuss Geisel was born 2 March 1904 in Springfield, MA. He graduated Dartmouth College in 1925, and proceeded on to Oxford University with the intent of acquiring a doctorate in literature. At Oxford he met Helen Palmer, who he wed in 1927. He returned from Europe in 1927, and began working for a magazine called Judge, the leading humor magazine in America at the time, submitting both cartoons and humorous articles for them. Additionally, he was submitting cartoons to Life, Vanity Fair and Liberty. In some of his works, he'd made reference to an insecticide called Flit. These references gained notice, and led to a contract to draw comic ads for Flit. This association lasted 17 years, gained him national exposure, and coined the catchphrase \"Quick, Henry, the Flit!\" In 1936 on the way to a vaction in Europe, listening to the rhythm of the ship's engines, he came up with And to Think That I Saw It on Mulberry Street, which was then promptly rejected by the first 43 publishers he showed it to. Eventually in 1937 a friend published the book for him, and it went on to at least moderate success. During WW II, Geisel joined the army and was sent to Hollywood. Captain Geisel would write for Frank Capra's Signal Corps Unit (for which he won the Legion of Merit) and do documentaries (he won Oscar's for Hitler Lives and Design for Death). He also created a cartoon called Gerald McBoing-Boing which also won him an Oscar. In May of 1954, Life published a report concerning illiteracy among school children. The report said, among other things, that children were having trouble to read because their books were boring. This inspired Geisel's publisher, and prompted him to send Geisel a list of 400 words he felt were important, asked him to cut the list to 250 words (the publishers idea of how many words at one time a first grader could absorb), and write a book. Nine months later, Geisel, using 220 of the words given to him published The Cat in the Hat, which went on to instant success. In 1960 Bennett Cerf bet Geisel $50 that he couldn't write an entire book using only fifty words. The result was Green Eggs and Ham. Cerf never paid the $50 from the bet. Helen Palmer Geisel died in 1967. Theodor Geisel married Audrey Stone Diamond in 1968. Theodor Seuss Geisel died 24 September 1991. Also worked under the pen name:Theo Le Sieg"
        }
    },
    {
        "quote": "“... a mind needs books as a sword needs a whetstone, if it is to keep its edge.”",
        "author": "George R.R. Martin",
        "authorUrl": "https://quotes.toscrape.com/author/George-R-R-Martin",
        "tags": ["books", "mind"],
        "authorDetail": {
            "bornDate": "September 20, 1948",
            "bornLocation": "in Bayonne, New Jersey, The United States",
            "description": "George R. R. Martin was born September 20, 1948, in Bayonne, New Jersey. His father was Raymond Collins Martin, a longshoreman, and his mother was Margaret Brady Martin. He has two sisters, Darleen Martin Lapinski and Janet Martin Patten. Martin attended Mary Jane Donohoe School and Marist High School. He began writing very young, selling monster stories to other neighborhood children for pennies, dramatic readings included. Later he became a comic book fan and collector in high school, and began to write fiction for comic fanzines (amateur fan magazines). Martin's first professional sale was made in 1970 at age 21: \"The Hero,\" sold to Galaxy, published in February, 1971 issue. Other sales followed. In 1970 Martin received a B.S. in Journalism from Northwestern University, Evanston, Illinois, graduating summa cum laude. He went on to complete a M.S. in Journalism in 1971, also from Northwestern. As a conscientious objector, Martin did alternative service 1972-1974 with VISTA, attached to Cook County Legal Assistance Foundation. He also directed chess tournaments for the Continental Chess Association from 1973-1976, and was a Journalism instructor at Clarke College, Dubuque, Iowa, from 1976-1978. He wrote part-time throughout the 1970s while working as a VISTA Volunteer, chess director, and teacher. In 1975 he married Gale Burnick. They divorced in 1979, with no children. Martin became a full-time writer in 1979. He was writer-in-residence at Clarke College from 1978-79. Moving on to Hollywood, Martin signed on as a story editor for Twilight Zone at CBS Television in 1986. In 1987 Martin became an Executive Story Consultant for Beauty and the Beast at CBS. In 1988 he became a Producer for Beauty and the Beast, then in 1989 moved up to Co-Supervising Producer. He was Executive Producer for Doorways, a pilot which he wrote for Columbia Pictures Television, which was filmed during 1992-93. Martin's present home is Santa Fe, New Mexico. He is a member of Science Fiction & Fantasy Writers of America (he was South-Central Regional Director 1977-1979, and Vice President 1996-1998), and of Writers' Guild of America, West. http://us.macmillan.com/author/george..."
        }
    }
]
